[
	{
		"file": "experiments/liveCodeExample.js",
		"name": "Flower",
		"description": "A live coding example provided by Bassima that uses rectangles to create petals and for loops to create repetition, resulting in a flower shape."
	},
	{
		"file": "experiments/molnar_01.js",
		"name": "Vera Molnar Squares",
		"description": "A recreation of an artwork by Vera Molnar, as originally demonstrated by Garrit Schaap. A grid is used with squares that overlap each other and become smaller as it reaches the center. The squares have an asymmetry and slight variation to them using variance. In this version, the squares change colour and size using loops, framerate control, and blend modes."
	},
	{
		"file": "experiments/molnar_02.js",
		"name": "Vera Molnar Shaky Lines",
		"description": "A recreation of an artwork by Vera Molnar. The majority of the code was created by Garrit Schaap. My twist on things is adding some noise to create shaky lines."
	},
	{
		"file": "experiments/noise_01.js",
		"name": "Perlin Noise Landscape",
		"description": "An example from Garrit Schaap that demonstrates the use of Perlin noise and noiseSeeds. Multiple small lines are drawn from one point to another on the x-axis using a for loop and are given pseudorandom points on the y-axis using Math.random. This results in a natural landscape effect."
	},
	{
		"file": "experiments/noise_02.js",
		"name": "Perlin Noise Depth",
		"description": "Another example from Garrit Schaap showing how Perlin noise can be used to create depth and shading. Points are scattered with varying sizes, allowing for a visual effect that looks almost 3d while remaining in 2d."
	},
	{
		"file": "experiments/noise_03.js",
		"name": "Perlin Noise Smoke",
		"description": "Final noise example from Garrit Schaap that animates the same points from noise_02 and allows for fluidity on the canvas, emulating the moving nature of smoke or clouds."
	},
	{
		"file": "experiments/waveforms_01.js",
		"name": "Curtain",
		"description": "Inspired by Manfred Mohr's use of noise and lines, this piece creates a 3-dimensional look of curtains."
	},
	{
		"file": "experiments/waveforms_02.js",
		"name": "Sound",
		"description": "Inspired by Manfred Mohr. Multiple lines, random HSB colours, and Perlin noise make for psychedelic curves, resembling that of soundwaves."
	},
	{
		"file": "experiments/waveforms_03.js",
		"name": "Vibrations",
		"description": "Inspired by Manfred Mohr. A built upon version of 'Sound' with proper movements and a gradient effect."
	},
	{
		"file": "experiments/hobbs_01.js",
		"name": "Feathering",
		"description": "Inspired by Tyler Hobbs. Using code by Garrit Schaap and ChatGPT prompts, I was able to create a randomised flow field that allows pink strokes to 'feather' out. An ADD blend mode was added for a gradient effect."
	},
	{
		"file": "experiments/hobbs_02.js",
		"name": "Attempted Escape",
		"description": "Inspired by Tyler Hobbs. Black and white lines overlap each other to create depth, almost like layered scratches, using code from Claude.ai prompts."
	},
	{
		"file": "experiments/hobbs_03.js",
		"name": "Hashing",
		"description": "Inspired by Tyler Hobbs. This iteration expands on the random quality and creates an ever-changing canvas by generating new strokes."
	},
	{
		"file": "experiments/cellularAutomata.js",
		"name": "Follow Your Heart",
		"description": "An example from Garrit that uses Cellular Automata and Boid classes to allow free flowing hearts to follow a mouse, die, and regenerate."
	},
	{
		"file": "experiments/waveforms_04.js",
		"name": "Speaking Waves",
		"description": "An example from Garrit that uses ToneJS (waveforms and frequency) and expands on a recreation of an artwork by Manfred Mohr."
	}
]
